{   
    "recipes": [
        {
            "id": 1,
            "name": "Breakfast Burritos",
            "description": "There are a lot of variations when it comes to the Breakfast Burrito, but we’ve put together the best combination to help you start your day strong. From the savory flavors in the sausage and peppers to the warm, melted cheese, you can’t go wrong with this morning classic.",
            "image": "https://mbc.studentlife.umich.edu/wp-content/uploads/2020/07/AB100372-1024x683.jpg",
            "ingredientList": [
                {"id":"1/4 cup sausage"},{"id": "1 tbsp chopped green bell peppers"},{"id": "1 tbsp choped red bell pepper"}],
            "preparation": "1. Chop and fry sausage (or beans if using) in a pan until cooked thoroughly. Drain off grease. Add green peppers and onions. Cook a few minutes more to saute vegetables.\n\n2. Add a bit of oil and an egg to the pan and continue to cook, stirring together until the eggs are done."
        }
    ],
    
    
    
    "posts": [
        {
            "id": 1,
            "title": "Milk Wars: What type of milk should we really be drinking?",
            "label": "Food Savvy Friday",
            "desc": "An analysis of the pros and cons associated with types of milk, including whole, skim, 2%, and non-dairy",
            "image": "https://mbc.studentlife.umich.edu/wp-content/uploads/2021/11/Milk-Wars-MBC-Blog-Photo.jpg",
            "content": [
            {
                "id": 1,
                "header": "",
                "text": "At most coffee shops we’re faced with the question: what milk would you like with that? When I was in high school I didn’t think twice about it and responded, “whatever you have.” Now as a student studying nutrition, I’ve started thinking more about the various types of milk and their unique health offerings. Should I drink the trendy, plant-based kinds of milk, or stick with tried-and-true cow’s milk? That’s why today I will be diving into the world of milk, analyzing the pros and cons of whole, skim, 2%, and non-dairy alternatives."
            },
            {
                "id": 2,
                "header": "WHOLE",
                "text": "Pargraph 2"
            }
            ]
        },
        {
            "id": 2,
            "title": "INTUITIVE EATING",
            "label": "Food Savvy Friday",
            "desc": "Tuning into hunger cues",
            "image": "https://mbc.studentlife.umich.edu/wp-content/uploads/2021/11/Intuitive-Eating-MBC-Post.jpg",
            "content": [
                {
                    "id": 1,
                    "header": "WHAT IS INTUITIVE EATING?",
                    "text": "Intuitive eating involves paying attention to how we feel before, during and after we eat. The things we should focus on when tuning in to our bodies include:\n\n1. Eating when you get hungry and stopping when you feel satisfied. \n\n2. Eating foods you enjoy, everything from vegetables to desserts. \n\n3. Making choices to nourish your body just as it is."
                },
                {
                    "id": 2,
                    "header": "WHAT ARE THE BENEFITS?",
                    "text": "Studies show that eating intuitively can help promote positive body image and reduce disordered eating while also improving overall health. Listening to your body can seem weird at first, so here are a few ways to try out intuitive eating on your own: \n\nBefore you sit down to eat, check in with yourself. How hungry are you on a scale of 1-10?\n\nEnjoy your food as you eat it. Try to pay attention to how satisfied you feel.\n\nIf you find yourself feeling satisfied, give yourself permission to stop eating. Even though we were told to clean our plates as children, it’s common to accidentally get too much food when loading up your plate.\n\nIf you still feel hungry after finishing a meal or snack, give yourself permission to eat something else.\n\nPack a few extra snacks in your backpack and, if you find yourself feeling hungry between meals, know that you can eat a snack and that’s okay.\n\nOur bodies need energy to move, study, think, socialize, and even just exist. Hunger is not bad—it’s just our bodies saying we probably need some more energy. Try out a few of these tips to get reconnected with your body and hunger."
                }
            ]
        },
        {
            "id": 3,
            "title": "A MACROSCOPIC LOOK AT MACROS",
            "label": "Food Savvy Friday",
            "image": "https://mbc.studentlife.umich.edu/wp-content/uploads/2021/10/Macros-MBC-Blog-Photo-Template.jpg",
            "desc": "Are fats good or bad for me? How much protein should I be getting? Should I be cutting out carbs? When it comes to the topic of macronutrients, there’s often a lot of confusion. And with so many misconceptions in society today, it’s important to understand what macronutrients really are and how they work together to keep the body functioning as it should.",
            "content": [
                {
                    "id": 1,
                    "header": "STARTING WITH THE BASICS",
                    "text": "Macronutrients are the nutrients we need to provide our bodies with energy so they can carry out their many jobs. The three main macronutrients are carbohydrates, proteins, and fats. Each one assists with different functions and is necessary for a well balanced diet—so it’s important to choose good sources of each one in order to maintain optimal health."
                },
                {
                    "id": 2,
                    "header": "LET’S BREAK IT DOWN (LITERALLY)",
                    "text": "Carbohydrates are organic compounds made up of sugars, starches, and fibers that break down as a key source of energy in the body. They can be found in foods such as whole grain breads, vegetables, and fruits, but also in foods like pastries and sodas. Carbohydrates are classified as simple or complex, based on their structure, with sugars being simple, and fiber and starches being complex. Because complex carbohydrates (usually things like vegetables and whole grains) take longer to digest, they allow you to feel fuller longer, unlike a simple sugar. More importantly, they promote healthy digestion and can even decrease the risk of certain cancers due to their high fiber content. They are more nutrient dense than simple carbs and can help control insulin levels, allowing the body to regulate blood sugar. Given that carbohydrates are the main source of energy for the body, it is most important to try to seek out good sources rather than limit them altogether (a common misconception in today’s culture). "
                },
                {
                    "id": 3,
                    "header": "THE BUILDING BLOCKS",
                    "text": "Protein is the main component of our cells and tissues, helping us repair and grow muscle and even produce hormones. These important molecules are actually chains of smaller components called amino acids. There are 22 amino acids that can be combined in various ways to create a protein, 9 of which the body cannot make itself. This is where food comes in! These amino acids must be taken in through food in order for the body to carry out its essential functions. Foods containing all 9 of these aminos are considered complete proteins, while foods that only contain a few are incomplete proteins. Incomplete foods can be paired with other sources to become “complete”. Great sources of protein include lean meats, seafood, tofu, beans, lentils, or nuts.    "
                },
                {
                    "id": 4,
                    "header": "STORING OUR ENERGY",
                    "text": "Fats are responsible for storing long-term energy, protecting the organs and insulating the body, supporting cell growth, and keeping cholesterol and blood pressure under control. There are different types of fats: saturated, unsaturated, and trans fats. Unsaturated fats have been shown to provide significant health benefits, such as reducing inflammation, lowering blood pressure, and reducing the risk of heart disease. Unsaturated fats can be found in foods such as avocados, olive oil, and some nuts and seeds. Saturated fats, on the other hand, are often referred to as bad fats that may cause health issues. They can be found in foods like milk, cheese, and meat, and are commonly grouped with trans fats. Trans fats, often labelled as “partially hydrogenated oils” on food packaging, have hydrogen added to them in order to make the food more solid. This is done to create a more desirable texture, which causes a buildup of fatty deposits that can lead to clogged arteries."
                },
                {
                    "id": 5,
                    "header": "CONCLUSION",
                    "text": "As you can see, macronutrients help to keep our bodies functioning as they should. They each provide different functions that are essential for maintaining good health, which is why it is so important to include each of these three nutrients in your daily food intake!"
                }
            ]
        }
    ],



    "announce": [
        {
            "id": 1,
            "text": "Come get radishes!",
            "link": "https://mbc.studentlife.umich.edu/news/"
        }
    ]
}