{   
    "recipes": [
        {
            "id": 1,
            "name": "Breakfast Burritos",
            "description": "There are a lot of variations when it comes to the Breakfast Burrito, but we’ve put together the best combination to help you start your day strong. From the savory flavors in the sausage and peppers to the warm, melted cheese, you can’t go wrong with this morning classic.",
            "ingredientList": [
                {"id":"1/4 cup sausage"},{"id": "1 tbsp chopped green bell peppers"},{"id": "1 tbsp choped red bell pepper"}],
            "ingredients": "1/4 cup sausage or chopped pork patties (beans if vegetarian)\n1 tbsp chopped green bell peppers\n1 tbsp chopped red bell peppers",
            "preparation": "1. Chop and fry sausage (or beans if using) in a pan until cooked thoroughly. Drain off grease. Add green peppers and onions. Cook a few minutes more to saute vegetables.\n2. Add a bit of oil and an egg to the pan and continue to cook, stirring together until the eggs are done."
        }
    ],
    
    
    
    "posts": [
        {
            "id": 1,
            "title": "Milk Wars: What type of milk should we really be drinking?",
            "label": "Food Savvy Friday",
            "desc": "An analysis of the pros and cons associated with types of milk, including whole, skim, 2%, and non-dairy",
            "content": [
            {
                "id": 1,
                "header": "",
                "text": "At most coffee shops we’re faced with the question: what milk would you like with that? When I was in high school I didn’t think twice about it and responded, “whatever you have.” Now as a student studying nutrition, I’ve started thinking more about the various types of milk and their unique health offerings. Should I drink the trendy, plant-based kinds of milk, or stick with tried-and-true cow’s milk? That’s why today I will be diving into the world of milk, analyzing the pros and cons of whole, skim, 2%, and non-dairy alternatives."
            },
            {
                "id": 2,
                "header": "WHOLE",
                "text": "Pargraph 2"
            }
            ]
        },
        {
            "id": 2,
            "title": "INTUITIVE EATING",
            "label": "Food Savvy Friday",
            "desc": "Tuning into hunger cues",
            "content": [
                {
                    "id": 1,
                    "header": "WHAT IS INTUITIVE EATING?",
                    "text": "Intuitive eating involves paying attention to how we feel before, during and after we eat. The things we should focus on when tuning in to our bodies include:\n\n1. Eating when you get hungry and stopping when you feel satisfied. \n\n2. Eating foods you enjoy, everything from vegetables to desserts. \n\n3. Making choices to nourish your body just as it is."
                },
                {
                    "id": 2,
                    "header": "WHAT ARE THE BENEFITS?",
                    "text": "Studies show that eating intuitively can help promote positive body image and reduce disordered eating while also improving overall health. Listening to your body can seem weird at first, so here are a few ways to try out intuitive eating on your own: \n\nBefore you sit down to eat, check in with yourself. How hungry are you on a scale of 1-10?\n\nEnjoy your food as you eat it. Try to pay attention to how satisfied you feel.\n\nIf you find yourself feeling satisfied, give yourself permission to stop eating. Even though we were told to clean our plates as children, it’s common to accidentally get too much food when loading up your plate.\n\nIf you still feel hungry after finishing a meal or snack, give yourself permission to eat something else.\n\nPack a few extra snacks in your backpack and, if you find yourself feeling hungry between meals, know that you can eat a snack and that’s okay.\n\nOur bodies need energy to move, study, think, socialize, and even just exist. Hunger is not bad—it’s just our bodies saying we probably need some more energy. Try out a few of these tips to get reconnected with your body and hunger."
                },
                {
                    "id":3,
                    "header": "SOURCES",
                    "text": "Bruce LJ, Ricciardelli LA. A systematic review of the psychosocial correlates of intuitive eating among adult women. Appetite. 2016 Jan 1;96:454-472. doi: 10.1016/j.appet.2015.10.012.\n\nSteven Hawks EdD, MBA, CHES, Ray M. Merrill PhD, MPH & Hala N. Madanat (2004) The Intuitive Eating Scale: Development and Preliminary Validation, American Journal of Health Education, 35:2, 90-99, DOI: 10.1080/19325037.2004.10603615\n\nVan Dyke N, Drinkwater EJ. Relationships between intuitive eating and health indicators: literature review. Public Health Nutr. 2014 Aug;17(8):1757-66. doi: 10.1017/S1368980013002139."
                }
            ]
        }
    ],



    "announce": [
        {
            "id": 1,
            "text": "Come get radishes!",
            "link": "https://mbc.studentlife.umich.edu/news/"
        }
    ]
}